#include<stdio.h>
int main()
{
 int row,col;
 scanf("%d %d",&row,&col);
int a[row][col];
 for(int i=0;i<row;i++)
{
for(int j=0;j<col;j++)
 {
scanf("%d",&a[i][j]);     । 
 }
 }
 int flag=1;                // একটি ফ্ল্যাগ ভেরিয়েবল নিয়ে শুরুতে ১ রেখে দিচ্ছি। যখনি দেখব সেকেন্ডারি ডায়াগোনাল ম্যাট্রিক্স না তখনি তাতে ০ রেখে দিব।
 if(row != col)           // শুরুতে চেক করছি এটি একটি স্কয়ার ম্যাট্রিক্স কিনা। 
 {
 flag=0;         // স্কয়ার ম্যাট্রিক্স না হলে ডায়াগোনাল ম্যাট্রিক্স হবে না তাই ফ্ল্যাগ এর মধ্যে ০ রেখে দিচ্ছি। 
}
for(int i=0;i<row;i++)
{
 for(int j=0;j<col;j++)    // নেস্টেড লুপ চালিয়ে পুরো ম্যাট্রিক্স এর মধ্যে যাওয়া হচ্ছে। 
{
if(i+j==row-1)        // যদি রো ইন্ডেক্স এবং কলাম ইন্ডেক্স এর যোগফল রো-১ এর সমান হয় তারমানে এখন আমরা সেকেন্ডারি ডায়াগোনাল এর উপরে আছি।
{
 continue;    // সেকেন্ডারি ডায়াগোনালে আমাদের চেক করার কিছু নেই তাই কন্টিনিউ করছি।
 }
if(a[i][j]!=0)   // যদি সেকেন্ডারি ডায়াগোনালে না থাকি এবং ম্যাট্রিক্স এর ভেলু ০ না হয় 
 flag=0;    // তাহলে এটি সেকেন্ডারি ডায়াগোনাল ম্যাট্রিক্স না, তাই ফ্ল্যাগ এর মধ্যে ০ রেখে দিচ্ছি। 
 }
if(flag==1)       // সবশেষে চেক করছি ফ্ল্যাগ এর মধ্যে ১ আছে কিনা। 
 {
printf("Secondary Diagonal\n");   // ১ থাকলে এটি একটি সেকেন্ডারি ডায়াগোনাল ম্যাট্রিক্স। 
 }
else
 {
 printf("Not Secondary Diagonal\n");  // আর ১ না থাকলে এটি একটি সেকেন্ডারি ডায়াগোনাল ম্যাট্রিক্স না। 
}
return 0;
}